#include<stdio.h>
#include"head_rpg.h"

int main()
{
    //ポインタ変数へのplayer変数の格納
    PLAYER *p = &player;
    MONSTER *m = &monster;


    printf("【ゲーム開始】\n\n");

    //======================
    //キャラクター選択
    //======================
    
    //パラメーター設定関数の呼び出し
    parameterset(p);


    //======================
    //戦闘準備
    //======================
    
    //戦闘前準備関数の呼び出し
    prebattle(p);


    //======================
    //戦闘開始
    //======================
    //ステージ1
    stone(p);


    return 0;

}