//進捗管理

/*
    8/18
    ・RPGの概要と流れを大まかに決定
    ・キャラクター、スキル、アイテムなどの設定、パラメーターを考えていく予定
    →すべて具体的な値を設定せずに、仮でだいたいの値を設定
    →設計、実装を先に行い、先に動かして値を設定していくイメージ
    また、全てのモンスター、アイテムを考えずにある程度の数にとどめておいて
    動かした後に、少しずつ追加していくイメージ

    （今後の流れ）
    ・設定値を最低限決める
    ・流れに従って（必要に応じてフローチャートを作成）、具体的な設計部分（関数、簡易的実装単位）を考える
    ・実装していく
    ・動く状態にする
    ・キャラクターやその他の要素などを詰めていって、少しずつ完成に近づけていく

    
    パラメーター設定の途中まで
    →残りアイテム部分？
    また、命中率などの要素を実装予定
    ↓
    大まかな設計を考えて実装していく
    ------------------------<<<<<<<<<<











    ------------------------<<<<<<<<<<
    その他メモ（気になったことなどをメモ）

    ・攻撃を避ける、外す要素も盛り込む（実装する）
    ・スキルなどに対しても攻撃力や回復量のブレを作ったほうがいい
    →現在は固定値になっているため、倍率などを掛けてブレを作る？（後で実装？）
    ・毒や麻痺などの状態異常効果を付ける（後で実装？）

*/